# language: ru
Функционал: Детальный росмотр результатов компании
  Для получение статистического отчета
  Бизнес пользователь выбрав компании
  Хочет оценить эффективность своей мобильной рекламы
  
  Предыстория:
    Допустим пользователь уже создал ранее рекламные компании:
  
  
  Сценарий: Пользователь открывает детальный просмотр рекламной компании
    Допустим я захожу на /campaigns
    Тогда я должен увидеть компанию "АБС"
    И кликнув на компанию "АБС"
    Тогда я должен увидеть Short адрес:
    К тому же я должен увидеть QR код: