app/controllers/barcodes_controller.rb

  def index
    @bar_codes = current_account.bar_codes
      .order('id DESC')
      .paginate(:page => params[:page], :per_page => 10)
---
SELECT * FROM `bar_codes` ORDER BY id DESC LIMIT 10

  def show
    @bar_code = current_account.bar_codes.find(params[:id])
---
SELECT * FROM `bar_codes` WHERE (`bar_codes`.`id` = 1)