app/controllers/shorteners_controller.rb

INSERT INTO `short_sequences` (`updated_at`, `created_at`) VALUES('2010-05-01 20:22:32', '2010-05-01 20:22:32')
INSERT INTO `short_urls` (`updated_at`, `title`, `origin`, `description`, `clicks_count`, `short`, `created_at`) VALUES('2010-05-03 14:33:13', NULL, 'http://ya.ru', NULL, 0, '1', '2010-05-03 14:33:13')
---
  def create
    @short_url = ShortUrl.new params[:short_url]
    if @short_url.valid?
      @short_url.short = Shortener.get_basemade_value(ShortSequence.create.id)