app/controllers/statistics_controller.rb

SELECT * FROM `short_urls` WHERE (`short_urls`.`id` = 2)
---
  def show
    @short_url = ShortUrl.find(params[:id])