app/controllers/welcome_controller.rb

  def redirect
    if @short_url = ShortUrl.find_by_short(params[:short])
      click = build_clicks_attributes and click = @short_url.clicks.create(click)
---
SELECT * FROM `short_urls` WHERE (`short_urls`.`short` = 'sss') LIMIT 1
INSERT INTO `clicks` (`updated_at`, `short_url_id`, `referer`, `user_agent_id`, `ip_address`, `created_at`) VALUES('2010-05-03 14:36:15', 1, NULL, 1, '127.0.0.1', '2010-05-03 14:36:15')